[
    {
        "name": "Single Agent",
        "description": "Features a single agent designed to handle straightforward tasks efficiently without additional complexity. Ideal for simple, clearly defined tasks. Example use: summarizing short documents or answering basic questions."
    },
    {
        "name": "Reflection",
        "description": "Consists of two agents—a main agent performing the primary task and a reflection agent that reviews performance and provides iterative feedback to improve performance. Suitable for tasks requiring refinement through feedback loops. Example use: iteratively improving a text draft or refining a strategic plan."
    },
    {
        "name": "Discussion",
        "description": "Engages multiple agents with distinct personas and roles in a collaborative dialogue, fostering creativity, brainstorming, idea generation, debate, and consensus building. Best for tasks benefiting from diverse perspectives. Example use: collaborative creative writing or strategic decision-making discussions."
    },
    {
        "name": "Parallel",
        "description": "Deploys multiple agents simultaneously, each addressing a specific aspect of the task, with outputs aggregated programmatically. Effective for complex tasks segmented into distinct sub-tasks. Example use: simultaneously translating documents into multiple languages or parallel processing of different chapters of a book."
    },
    {
        "name": "Supervision",
        "description": "Combines a supervisor agent overseeing multiple specialized worker agents. The supervisor dynamically routes requests based on varying requirements, efficiently managing and coordinating workers. Suitable for tasks with diverse and shifting focuses. Example use: diagnosing and classifying input to delegate them to specialized worker agents, such as refining content in aspects of creativity, clarity, or accuracy."
    },    
    {
        "name": "Web Search Agent",
        "description": "Utilizes a single agent equipped with web search capabilities to gather relevant information online. Ideal for tasks requiring extensive online research. Example use: conducting market research or gathering recent scientific findings."
    },
    {
        "name": "PDF Loader Agent",
        "description": "Employs a single agent capable of loading and analyzing PDF documents. Best suited for tasks involving reading, understanding, and extracting insights from PDF files. Example use: reviewing academic papers or extracting information from reports."
    }
]