[
  {
    "id": "task3",
    "name": "[Dev Test] Travel Planning",
    "requiresUpload": false,
    "description": "Plan a travel itinerary for a given destination.",
    "uploadedFile": null
  },
  {
    "id": "task4",
    "name": "[User Case] Generate Podcast Script",
    "requiresUpload": false,
    "description": "Generate an engaging and informative podcast script based on a specified event or topic. The script should include a captivating introduction that immediately grabs listeners' attention, clear segments or discussion points structured logically throughout the podcast, and a strong closing summary or call to action. It should also suggest appropriate moments for incorporating interviews, guest experts, listener questions, or interactive elements if applicable. The generated script must be suitable for a defined target audience, maintaining an appropriate tone and style, ranging from casual and conversational to formal and informative. Additionally, the script overall length should be about five minutes, and should specify the ideal duration for each segment and the overall podcast length, ensuring the content flows naturally and maintains listener engagement throughout.",
    "uploadedFile": null
  },
  {
    "id": "task5",
    "name": "[User Case] Review a Paper",
    "requiresUpload": false,
    "description": "Conduct a comprehensive and systematic review of a specified academic paper. The review process should emulate standard peer-review practices or other review processes. The output should include explicit recommendation regarding acceptance, revision, or rejection, clearly justifying this decision with detailed and supportive arguments.",
    "uploadedFile": null
  },
  {
    "id": "task1",
    "name": "Generate Presentation Script",
    "requiresUpload": false,
    "description": "Generate a detailed and well-structured presentation script based on a specified topic. The script should feature an engaging opening to immediately capture the audience's attention, clearly outlined key points that align logically with visual elements (such as slides or graphics), smooth transitions between sections, and a concise, impactful conclusion. It should incorporate suggestions for visual aids or multimedia content to enhance understanding and retention of information. The generated script must cater to the intended audience, appropriately balancing technical detail with accessibility and maintaining a tone suitable for professional, educational, or casual settings as required. Additionally, the script should recommend an ideal presentation duration, with timing allocated effectively for each key segment to ensure clarity and audience engagement.",
    "uploadedFile": null
  },
  {
    "id": "task2",
    "name": "Machine Learning Visualization",
    "requiresUpload": true,
    "description": "Visualize a given machine learning model.",
    "uploadedFile": null
  }
]