{
    "taskFlows": [
      {
        "taskFlowId": "tf1",
        "taskFlowName": "Research-Driven Script Generation",
        "taskFlowDescription": "Focuses on thorough research and factual accuracy to craft a comprehensive podcast script.",
        "taskFlowSteps": [
          {
            "stepName": "Topic Analysis",
            "stepLabel": "Analyzing Topics",
            "stepDescription": "Carefully examine and break down the given event or topic list to identify core themes and key discussion points."
          },
          {
            "stepName": "In-depth Research",
            "stepLabel": "Gathering Information",
            "stepDescription": "Conduct extensive research on each identified topic, collecting facts, statistics, expert opinions, and relevant historical context."
          },
          {
            "stepName": "Outline Creation",
            "stepLabel": "Building Outline",
            "stepDescription": "Organize the research material into a logical outline, structuring segments clearly to ensure smooth transitions between topics."
          },
          {
            "stepName": "Draft Script",
            "stepLabel": "Initial Script Drafting",
            "stepDescription": "Write the initial script based on the structured outline, ensuring clarity, factual accuracy, and informative value."
          },
          {
            "stepName": "Expert Review",
            "stepLabel": "Fact Checking and Review",
            "stepDescription": "Review the script for accuracy, consistency, and coherence, consulting expert sources or additional materials as needed."
          }
        ]
      },
      {
        "taskFlowId": "tf2",
        "taskFlowName": "Conversational and Engaging Approach",
        "taskFlowDescription": "Prioritizes audience engagement through storytelling, anecdotes, and a conversational tone.",
        "taskFlowSteps": [
          {
            "stepName": "Audience Profiling",
            "stepLabel": "Understanding Audience",
            "stepDescription": "Identify the target audience's interests, preferences, and desired tone for the podcast."
          },
          {
            "stepName": "Story Ideation",
            "stepLabel": "Generating Stories",
            "stepDescription": "Brainstorm relatable stories, engaging anecdotes, or personal experiences that align with the given event or topics."
          },
          {
            "stepName": "Conversational Outline",
            "stepLabel": "Mapping Conversation",
            "stepDescription": "Develop a conversational structure for the script, emphasizing informal dialogue, listener engagement, and narrative flow."
          },
          {
            "stepName": "Script Drafting",
            "stepLabel": "Writing Conversational Script",
            "stepDescription": "Create a conversational script, integrating anecdotes and humor to maintain listener interest and foster a personal connection."
          },
          {
            "stepName": "Engagement Enhancement",
            "stepLabel": "Boosting Engagement",
            "stepDescription": "Review and enhance the script by adding rhetorical questions, interactive elements, or calls-to-action to boost listener engagement."
          },
          {
            "stepName": "Final Review",
            "stepLabel": "Finalizing Conversational Tone",
            "stepDescription": "Perform a final review to ensure consistency in tone, natural flow, and strong listener appeal."
          }
        ]
      },
      {
        "taskFlowId": "tf3",
        "taskFlowName": "Rapid Iterative Scripting",
        "taskFlowDescription": "Utilizes rapid prototyping, quick iteration, and incremental refinements to quickly produce and polish a podcast script.",
        "taskFlowSteps": [
          {
            "stepName": "Rapid Brainstorming",
            "stepLabel": "Quick Ideation",
            "stepDescription": "Quickly generate a wide array of ideas, themes, and perspectives related to the provided event or topic list without filtering initially."
          },
          {
            "stepName": "Rapid Outline",
            "stepLabel": "Drafting Quick Outline",
            "stepDescription": "Rapidly structure the most promising ideas into a coherent outline, emphasizing main talking points and potential sub-points."
          },
          {
            "stepName": "Initial Fast Draft",
            "stepLabel": "First Draft Writing",
            "stepDescription": "Quickly create a rough draft script, prioritizing speed and coverage over precision and polish."
          },
          {
            "stepName": "Iterative Refinement",
            "stepLabel": "Improving Drafts",
            "stepDescription": "Conduct iterative improvements, progressively enhancing script quality, clarity, and flow through repeated quick revisions."
          },
          {
            "stepName": "Feedback Incorporation",
            "stepLabel": "Applying Feedback",
            "stepDescription": "Solicit brief, targeted feedback from peers or test listeners, rapidly incorporating constructive feedback into the script."
          },
          {
            "stepName": "Polished Script",
            "stepLabel": "Final Polish",
            "stepDescription": "Perform a final refinement of the script, focusing on readability, clarity, and overall listener experience."
          }
        ]
      }
    ]
  }
  